# CLI tool for working with Architecture Decision Records
# https://github.com/npryce/adr-tools
brew "adr-tools"

# The Kubernetes package manager
# https://helm.sh/
brew "helm"

# HTTP load generator, ApacheBench (ab) replacement
# https://github.com/rakyll/hey
brew "hey"

# User-friendly cURL replacement (command-line HTTP client)
# https://httpie.org/
brew "httpie"

# Lightweight and flexible command-line JSON processor
# https://stedolan.github.io/jq/
brew "jq"

# Kubernetes CLI To Manage Your Clusters In Style!
# https://k9scli.io/
brew "k9s"

# SDK for building Kubernetes APIs using CRDs
# https://github.com/kubernetes-sigs/kubebuilder
brew "kubebuilder"

# Tool that can switch between kubectl contexts easily and create aliases
# https://github.com/ahmetb/kubectx
brew "kubectx"

# Kubernetes command-line interface
# https://kubernetes.io/
brew "kubernetes-cli"

# Run a Kubernetes cluster locally
# https://minikube.sigs.k8s.io/
brew "minikube"

# SDK for building Kubernetes applications
# https://coreos.com/operators/
brew "operator-sdk"

# Easy and Repeatable Kubernetes Development
# https://github.com/GoogleContainerTools/skaffold
brew "skaffold"

# The debugger for microservices
# https://squash.solo.io/
brew "solo-io/tap/squashctl"

# Executes a program periodically, showing output fullscreen
# https://gitlab.com/procps-ng/procps
brew "watch"

# Linter for YAML files
# https://github.com/adrienverge/yamllint
brew "yamllint"

# Process YAML documents from the CLI
# https://github.com/mikefarah/yq
brew "yq"
